#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/namitjagtiani/gh-actions-demo/runs/run-vsTuACQ3mLyjVvLZ

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=leading-insect]
azurerm_resource_group.wus-rg: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg]
azurerm_network_security_group.wus-nsg: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/networkSecurityGroups/NSGS1]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_route_table.wus-rt will be created
  + resource "azurerm_route_table" "wus-rt" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "westus"
      + name                          = "example-routetable"
      + resource_group_name           = "wus-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0"
              + name                   = "example"
              + next_hop_in_ip_address = "10.10.1.1"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_subnet_route_table_association.wus-rt-association-1 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet1"
    }

  # azurerm_subnet_route_table_association.wus-rt-association-2 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet2"
    }

  # azurerm_subnet_route_table_association.wus-rt-association-3 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet3"
    }

  # azurerm_virtual_network.example will be updated in-place
  ~ resource "azurerm_virtual_network" "example" {
        id                    = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1"
        name                  = "virtualNetwork1"
      ~ subnet                = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet1"
              - name           = "subnet1"
              - security_group = ""
            },
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet1"
              + name           = "subnet1"
              + security_group = null
            },
          - {
              - address_prefix = "10.0.2.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet2"
              - name           = "subnet2"
              - security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet2"
              + name           = "subnet2"
              + security_group = null
            },
            # (2 unchanged elements hidden)
        ]
        tags                  = {
            "environment" = "Production"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @namitjagtiani, Action: `pull_request`*